#!/usr/bin/env python3
#coding: utf-8

def ОЗперв(ОЗизгот, О3транс, ОЗмонтаж):
    return ОЗизгот + ОЗтранс + ОЗмонтаж

def ОЗвосст(Црынк, колОЗ):
    return Црынк * колОЗ

def ОЗбал(ОЗперв, лет, аморт):
    return ОЗперв - аморт * лет

def table_print(*a):
    print(*a, sep=' ')

def Апрямол(перв_стоим, ликв_стоим, лет):
    Агод = (перв_стоим - ликв_стоим) / лет

    table_print("Период", "Перв", "Сум", "Накопл", "Остаточ")
    накоп = 0
    for i in range(лет + 1):
        table_print(i, перв_стоим, Агод if i else 0, накоп, перв_стоим - накоп)
        накоп += Агод

def Аком(перв_стоим, ликв_стоим, лет):
    a = 0

    for i in range(1, лет + 1):
        a += i

    k = [x / a for x in range(лет, 0, -1)]

    table_print("Период", "Перв", "Сум", "Накопл", "Остаточ")

    table_print(0, перв_стоим, 0, 0, перв_стоим)
    
    накоп = 0

    for i in range(лет):
        tmp = (перв_стоим - ликв_стоим) * k[i]
        накоп += tmp
        table_print(i + 1, перв_стоим, tmp, накоп, перв_стоим - накоп)

def Апроизв(перв_стоим, ликв_стоим, лет, произв:tuple):
    произв_сум = 0

    for i in произв:
        произв_сум += i

    k = (перв_стоим - ликв_стоим) / произв_сум

    table_print("Период", "Перв", "Сум", "Накопл", "Остаточ")

    table_print(0, перв_стоим, 0, 0, перв_стоим)
    
    накоп = 0

    for i in range(лет):
        tmp = произв[i] * k
        накоп += tmp
        table_print(i + 1, перв_стоим, tmp, накоп, перв_стоим - накоп)
